TsunamiDing/STM32-game-by-C/Exp1/Board/EIE3810_TFTLCD.c
#include "stm32f10x.h"
#include "EIE3810_TFTLCD.h"
#include "Font.H"

extern void Delay(u32 count);

void EIE3810_TFTLCD_WrCmdData(u16 cmd,u16 data)
{	
	* (u16 *) LCD_COMMAND = cmd;		
	* (u16 *) LCD_DATA = data;    		 
}	

void EIE3810_TFTLCD_WrCmd(u16 cmd)
{
	* (u16 *) LCD_COMMAND = cmd;
}

void EIE3810_TFTLCD_WrData(u16 data)
{
	* (u16 *) LCD_DATA = data;
}

void EIE3810_TFTLCD_DrawDot(u16 x, u16 y, u16 color)
{
	EIE3810_TFTLCD_WrCmd(0x2A00);
	EIE3810_TFTLCD_WrData(x>>8);
	EIE3810_TFTLCD_WrCmd(0x2A01);
	EIE3810_TFTLCD_WrData(x & 0xFF);

	EIE3810_TFTLCD_WrCmd(0x2B00);
	EIE3810_TFTLCD_WrData(y>>8);
	EIE3810_TFTLCD_WrCmd(0x2B01);
	EIE3810_TFTLCD_WrData(y & 0xFF);	
	
	EIE3810_TFTLCD_WrCmd(0x2C00);
	EIE3810_TFTLCD_WrData(color);
}

void EIE3810_TFTLCD_DrawBackground(u16 color)
{
	int i;
	EIE3810_TFTLCD_WrCmd(0x3600);	
	EIE3810_TFTLCD_WrData(0x0000);
	EIE3810_TFTLCD_WrCmd(0x2C00);
	for (i=0; i<384000; i++){
		EIE3810_TFTLCD_WrData(color);
	}
}

void EIE3810_TFTLCD_FillRectangle(u16 start_x, u16 length_x,
																	u16 start_y, u16 length_y, u16 color)
{
	u32 index = 0;
	EIE3810_TFTLCD_WrCmd(0x2A00);
	EIE3810_TFTLCD_WrData(start_x >> 8);
	EIE3810_TFTLCD_WrCmd(0x2A01);
	EIE3810_TFTLCD_WrData(start_x & 0xFF);
	EIE3810_TFTLCD_WrCmd(0x2A02);
	EIE3810_TFTLCD_WrData((length_x + start_x - 1) >> 8);
	EIE3810_TFTLCD_WrCmd(0x2A03);
	EIE3810_TFTLCD_WrData((length_x + start_x - 1) & 0xFF);
	
	EIE3810_TFTLCD_WrCmd(0x2B00);
	EIE3810_TFTLCD_WrData(start_y >> 8);
	EIE3810_TFTLCD_WrCmd(0x2B01);
	EIE3810_TFTLCD_WrData(start_y & 0xFF);
	EIE3810_TFTLCD_WrCmd(0x2B02);
	EIE3810_TFTLCD_WrData((length_y + start_y - 1) >> 8);
	EIE3810_TFTLCD_WrCmd(0x2B03);
	EIE3810_TFTLCD_WrData((length_y + start_y - 1) & 0xFF);
	
	EIE3810_TFTLCD_WrCmd(0x2C00);
	for (index=0; index<length_x*length_y; index++){
		EIE3810_TFTLCD_WrData(color);
	}
}

void EIE3810_TFTLCD_SevenSegment(u16 start_x, u16 start_y, u8 digit, u16 color)
{ 
	if (digit == 0){
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+130, 10, color);
	}
	if (digit == 1){
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+75, 55, color);
	}	
	if (digit == 2){
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+65, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+130, 10, color);
	}
	if (digit == 3){
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+65, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+130, 10, color);
	}	
	if (digit == 4){
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+65, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+75, 55, color);
	}
	if (digit == 5){
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+65, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+130, 10, color);
	}	
	if (digit == 6){
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+65, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+130, 10, color);
	}
	if (digit == 7){
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+75, 55, color);
	}	
	if (digit == 8){
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+65, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+130, 10, color);
	}
	if (digit == 9){
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+10, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+65, 10, color);
		EIE3810_TFTLCD_FillRectangle(start_x+65, 10, start_y+75, 55, color);
		EIE3810_TFTLCD_FillRectangle(start_x+10, 55, start_y+130, 10, color);
	}	
}

void EIE3810_TFTLCD_DrawCircle(u16 x0,u16 y0, u8 r, u8 full,u16 color) 
	/* x0, y0 : center of the circle; r: radius; full: whether the circle is hollow or solid; color: color of the circle.*/
{
	int a,b;
	int di,yi;
	a=0;b=r;	  
	di=3-(r<<1);             
  if(!full)        //Hollow circle        
  {
			while(a<=b) 
			{
					EIE3810_TFTLCD_DrawDot(x0+a,y0-b,color);             
					EIE3810_TFTLCD_DrawDot(x0+b,y0-a,color);             
					EIE3810_TFTLCD_DrawDot(x0+b,y0+a,color);             
					EIE3810_TFTLCD_DrawDot(x0+a,y0+b,color);             
					EIE3810_TFTLCD_DrawDot(x0-a,y0+b,color);             
					EIE3810_TFTLCD_DrawDot(x0-b,y0+a,color);             
					EIE3810_TFTLCD_DrawDot(x0-a,y0-b,color);             
					EIE3810_TFTLCD_DrawDot(x0-b,y0-a,color);             
					a++;					
					//Use Bresenham algorithm 
					if(di<0)di +=4*a+6;	  
					else
					{
						di+=10+4*(a-b);   
						b--;
					} 						    
			}
	}
  else                   //  Solid circle
	{
			while(a<=b)
			{
					for(yi=a;yi<=b;yi++)
					{
							EIE3810_TFTLCD_DrawDot(x0+a,y0-yi,color);             
							EIE3810_TFTLCD_DrawDot(x0+yi,y0-a,color);             
							EIE3810_TFTLCD_DrawDot(x0+yi,y0+a,color);             
							EIE3810_TFTLCD_DrawDot(x0+a,y0+yi,color);             
							EIE3810_TFTLCD_DrawDot(x0-a,y0+yi,color);             
							EIE3810_TFTLCD_DrawDot(x0-yi,y0+a,color);             
							EIE3810_TFTLCD_DrawDot(x0-a,y0-yi,color);             
							EIE3810_TFTLCD_DrawDot(x0-yi,y0-a,color);             
					}
					a++;
					//Use Bresenham algorithm 
					if(di<0)di +=4*a+6;	  
					else
					{
						di+=10+4*(a-b);   
						b--;
					} 						    
			}
	}
}	

/*****    24 *12 fonts        *********/

void EIE3810_TFTLCD_ShowChar1608(u16 x, u16 y, u8 ascii, u16 color, u16 bgcolor)
{
	EIE3810_TFTLCD_FillRectangle(x,8,y,16,bgcolor);
	int i,j,k;
	for (i=0;i<16;i++)
	{
		j = asc2_1608[ascii-32][i];
		for (k=0;k<8;k++)
		{
			if (((j>>k)&1)==1)
			{	
				EIE3810_TFTLCD_DrawDot(x+(i/2),y+8-k+(8*(i%2)),color);
			}
		}
	}
}

void EIE3810_TFTLCD_ShowChar2412(u16 x, u16 y, u8 ascii, u16 color, u16 bgcolor)
{
	u8 i,j;
	u8 index;
	u8 height = 24, length = 12;
	if(ascii < 32 || ascii > 127) return;
	ascii -= 32;
	
