TsunamiDing/STM32-game-by-C/Exp1/Board/EIE3810_TFTLCD.c
	EIE3810_TFTLCD_WrCmd(0x2A00); EIE3810_TFTLCD_WrData(x >> 8);
	EIE3810_TFTLCD_WrCmd(0x2A01); EIE3810_TFTLCD_WrData(x & 0xFF);
	EIE3810_TFTLCD_WrCmd(0x2A02); EIE3810_TFTLCD_WrData((length + x - 1) >> 8);
	EIE3810_TFTLCD_WrCmd(0x2A03); EIE3810_TFTLCD_WrData((length + x - 1) & 0xFF);
	
	EIE3810_TFTLCD_WrCmd(0x2B00);	EIE3810_TFTLCD_WrData(y >> 8);
	EIE3810_TFTLCD_WrCmd(0x2B01);	EIE3810_TFTLCD_WrData(y & 0xFF);		
	EIE3810_TFTLCD_WrCmd(0x2B02);	EIE3810_TFTLCD_WrData((height + y - 1)>> 8);
	EIE3810_TFTLCD_WrCmd(0x2B03);	EIE3810_TFTLCD_WrData((height + y - 1) & 0xFF);	
	
	EIE3810_TFTLCD_WrCmd(0x2C00);
	
	for(j=0; j<height/8;j++)                      
	{
		for(i=0; i<height/3;i++)
		{
			for(index=0; index<length; index++)
			{
				if((asc2_2412[ascii][index*3+j]<<i) & 0x80)
					EIE3810_TFTLCD_WrData(color);
				else EIE3810_TFTLCD_WrData(bgcolor);
			}
		}
	}
}

void EIE3810_TFTLCD_Init(void)
{
	RCC->AHBENR|=1<<8;     	 	//Enable FSMC clock	  
  RCC->APB2ENR|=1<<3;     	//Enable PORTB clock
	RCC->APB2ENR|=1<<5;     	//Enable PORTD clock
	RCC->APB2ENR|=1<<6;     	//Enable PORTE clock
 	RCC->APB2ENR|=1<<8;      	//Enable PORTG clock
	GPIOB->CRL&=0XFFFFFFF0;		//PB0
	GPIOB->CRL|=0X00000003;	   
	
	//PORTD
	GPIOD->CRH&=0X00FFF000;
	GPIOD->CRH|=0XBB000BBB; 
	GPIOD->CRL&=0XFF00FF00;
	GPIOD->CRL|=0X00BB00BB;  
	
	//PORTE
	GPIOE->CRH&=0X00000000;
	GPIOE->CRH|=0XBBBBBBBB; 
	GPIOE->CRL&=0X0FFFFFFF;
	GPIOE->CRL|=0XB0000000;  
	
	//PORTG12
	GPIOG->CRH&=0XFFF0FFFF;
	GPIOG->CRH|=0X000B0000; 
	GPIOG->CRL&=0XFFFFFFF0;//PG0->RS
	GPIOG->CRL|=0X0000000B;  

	//Set FSMC registers to 0		    
	FSMC_Bank1->BTCR[6]=0X00000000;
	FSMC_Bank1->BTCR[7]=0X00000000;
	FSMC_Bank1E->BWTR[6]=0X00000000;

	FSMC_Bank1->BTCR[6]|=1<<12;		//Add comments
	FSMC_Bank1->BTCR[6]|=1<<14;		//Add comments
	FSMC_Bank1->BTCR[6]|=1<<4; 		//Add comments
						    
	FSMC_Bank1->BTCR[7]|=0<<28;		//Add comments
	FSMC_Bank1->BTCR[7]|=1<<0; 		//Add comments
	FSMC_Bank1->BTCR[7]|=0XF<<8;  	//Add comments
	
	FSMC_Bank1E->BWTR[6]|=0<<28; 	//Add comments
	FSMC_Bank1E->BWTR[6]|=0<<0;		//Add comments
 	FSMC_Bank1E->BWTR[6]|=3<<8; 	//Add comments
	
	FSMC_Bank1->BTCR[6]|=1<<0;		//Add comments
	
	Delay(500000);
	
	EIE3810_TFTLCD_SetParameter();	
	
	LCD_LIGHT_ON;

}

void EIE3810_TFTLCD_SetParameter(void)
{


		EIE3810_TFTLCD_WrCmdData(0xF000,0x55);
		EIE3810_TFTLCD_WrCmdData(0xF001,0xAA);
		EIE3810_TFTLCD_WrCmdData(0xF002,0x52);
		EIE3810_TFTLCD_WrCmdData(0xF003,0x08);
		EIE3810_TFTLCD_WrCmdData(0xF004,0x01);
		//AVDD Set AVDD 5.2V
		EIE3810_TFTLCD_WrCmdData(0xB000,0x0D);
		EIE3810_TFTLCD_WrCmdData(0xB001,0x0D);
		EIE3810_TFTLCD_WrCmdData(0xB002,0x0D);
		//AVDD ratio
		EIE3810_TFTLCD_WrCmdData(0xB600,0x35);
		EIE3810_TFTLCD_WrCmdData(0xB601,0x35);
		EIE3810_TFTLCD_WrCmdData(0xB602,0x35);
		//AVEE -5.2V
		EIE3810_TFTLCD_WrCmdData(0xB100,0x0D);
		EIE3810_TFTLCD_WrCmdData(0xB101,0x0D);
		EIE3810_TFTLCD_WrCmdData(0xB102,0x0D);
		//AVEE ratio
		EIE3810_TFTLCD_WrCmdData(0xB700,0x35);
		EIE3810_TFTLCD_WrCmdData(0xB701,0x35);
		EIE3810_TFTLCD_WrCmdData(0xB702,0x35);
		//VCL -2.5V
		EIE3810_TFTLCD_WrCmdData(0xB200,0x00);
		EIE3810_TFTLCD_WrCmdData(0xB201,0x00);
		EIE3810_TFTLCD_WrCmdData(0xB202,0x00);
		//VCL ratio
		EIE3810_TFTLCD_WrCmdData(0xB800,0x24);
		EIE3810_TFTLCD_WrCmdData(0xB801,0x24);
		EIE3810_TFTLCD_WrCmdData(0xB802,0x24);
		//VGH 15V (Free pump)
		EIE3810_TFTLCD_WrCmdData(0xBF00,0x01);
		EIE3810_TFTLCD_WrCmdData(0xB300,0x08);
		EIE3810_TFTLCD_WrCmdData(0xB301,0x08);
		EIE3810_TFTLCD_WrCmdData(0xB302,0x08);
		//VGH ratio
		EIE3810_TFTLCD_WrCmdData(0xB900,0x34);
		EIE3810_TFTLCD_WrCmdData(0xB901,0x34);
		EIE3810_TFTLCD_WrCmdData(0xB902,0x34);
		//VGLX ratio
		EIE3810_TFTLCD_WrCmdData(0xBA00,0x24);
		EIE3810_TFTLCD_WrCmdData(0xBA01,0x24);
		EIE3810_TFTLCD_WrCmdData(0xBA02,0x24);
		//VGMP/VGSP 4.7V/0V
		EIE3810_TFTLCD_WrCmdData(0xBC00,0x00);
		EIE3810_TFTLCD_WrCmdData(0xBC01,0x88);
		EIE3810_TFTLCD_WrCmdData(0xBC02,0x00);
		//VGMN/VGSN -4.7V/0V
		EIE3810_TFTLCD_WrCmdData(0xBD00,0x00);
		EIE3810_TFTLCD_WrCmdData(0xBD01,0x88);
		EIE3810_TFTLCD_WrCmdData(0xBD02,0x00);
		//VCOM
		EIE3810_TFTLCD_WrCmdData(0xBE00,0x00);
		EIE3810_TFTLCD_WrCmdData(0xBE01,0xA3);
		//Gamma Setting
		EIE3810_TFTLCD_WrCmdData(0xD100,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD101,0x05);
		EIE3810_TFTLCD_WrCmdData(0xD102,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD103,0x40);
		EIE3810_TFTLCD_WrCmdData(0xD104,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD105,0x60);
		EIE3810_TFTLCD_WrCmdData(0xD106,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD107,0x90);
		EIE3810_TFTLCD_WrCmdData(0xD108,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD109,0x99);
		EIE3810_TFTLCD_WrCmdData(0xD10A,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD10B,0xBB);
		EIE3810_TFTLCD_WrCmdData(0xD10C,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD10D,0xDC);
		EIE3810_TFTLCD_WrCmdData(0xD10E,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD10F,0x04);
		EIE3810_TFTLCD_WrCmdData(0xD110,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD111,0x25);
		EIE3810_TFTLCD_WrCmdData(0xD112,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD113,0x59);
		EIE3810_TFTLCD_WrCmdData(0xD114,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD115,0x82);
		EIE3810_TFTLCD_WrCmdData(0xD116,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD117,0xC6);
		EIE3810_TFTLCD_WrCmdData(0xD118,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD119,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD11A,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD11B,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD11C,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD11D,0x39);
		EIE3810_TFTLCD_WrCmdData(0xD11E,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD11F,0x79);
		EIE3810_TFTLCD_WrCmdData(0xD120,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD121,0xA1);
		EIE3810_TFTLCD_WrCmdData(0xD122,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD123,0xD9);
		EIE3810_TFTLCD_WrCmdData(0xD124,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD125,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD126,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD127,0x38);
		EIE3810_TFTLCD_WrCmdData(0xD128,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD129,0x67);
		EIE3810_TFTLCD_WrCmdData(0xD12A,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD12B,0x8F);
		EIE3810_TFTLCD_WrCmdData(0xD12C,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD12D,0xCD);
		EIE3810_TFTLCD_WrCmdData(0xD12E,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD12F,0xFD);
		EIE3810_TFTLCD_WrCmdData(0xD130,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD131,0xFE);
		EIE3810_TFTLCD_WrCmdData(0xD132,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD133,0xFF);
		
