TsunamiDing/STM32-game-by-C/Exp1/Board/EIE3810_TFTLCD.c
		EIE3810_TFTLCD_WrCmdData(0xD200,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD201,0x05);
		EIE3810_TFTLCD_WrCmdData(0xD202,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD203,0x40);
		EIE3810_TFTLCD_WrCmdData(0xD204,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD205,0x6D);
		EIE3810_TFTLCD_WrCmdData(0xD206,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD207,0x90);
		EIE3810_TFTLCD_WrCmdData(0xD208,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD209,0x99);
		EIE3810_TFTLCD_WrCmdData(0xD20A,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD20B,0xBB);
		EIE3810_TFTLCD_WrCmdData(0xD20C,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD20D,0xDC);
		
		EIE3810_TFTLCD_WrCmdData(0xD20E,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD20F,0x04);
		EIE3810_TFTLCD_WrCmdData(0xD210,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD211,0x25);
		EIE3810_TFTLCD_WrCmdData(0xD212,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD213,0x59);
		EIE3810_TFTLCD_WrCmdData(0xD214,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD215,0x82);
		EIE3810_TFTLCD_WrCmdData(0xD216,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD217,0xC6);
		EIE3810_TFTLCD_WrCmdData(0xD218,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD219,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD21A,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD21B,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD21C,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD21D,0x39);
		EIE3810_TFTLCD_WrCmdData(0xD21E,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD21F,0x79);
		EIE3810_TFTLCD_WrCmdData(0xD220,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD221,0xA1);
		EIE3810_TFTLCD_WrCmdData(0xD222,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD223,0xD9);
		EIE3810_TFTLCD_WrCmdData(0xD224,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD225,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD226,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD227,0x38);
		EIE3810_TFTLCD_WrCmdData(0xD228,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD229,0x67);
		EIE3810_TFTLCD_WrCmdData(0xD22A,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD22B,0x8F);
		EIE3810_TFTLCD_WrCmdData(0xD22C,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD22D,0xCD);
		EIE3810_TFTLCD_WrCmdData(0xD22E,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD22F,0xFD);			
		EIE3810_TFTLCD_WrCmdData(0xD230,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD231,0xFE);
		EIE3810_TFTLCD_WrCmdData(0xD232,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD233,0xFF);
		
		EIE3810_TFTLCD_WrCmdData(0xD300,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD301,0x05);
		EIE3810_TFTLCD_WrCmdData(0xD302,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD303,0x40);
		EIE3810_TFTLCD_WrCmdData(0xD304,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD305,0x6D);
		EIE3810_TFTLCD_WrCmdData(0xD306,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD307,0x90);
		EIE3810_TFTLCD_WrCmdData(0xD308,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD309,0x99);
		EIE3810_TFTLCD_WrCmdData(0xD30A,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD30B,0xBB);
		EIE3810_TFTLCD_WrCmdData(0xD30C,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD30D,0xDC);
		
		EIE3810_TFTLCD_WrCmdData(0xD30E,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD30F,0x04);
		EIE3810_TFTLCD_WrCmdData(0xD310,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD311,0x25);
		EIE3810_TFTLCD_WrCmdData(0xD312,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD313,0x59);
		EIE3810_TFTLCD_WrCmdData(0xD314,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD315,0x82);
		EIE3810_TFTLCD_WrCmdData(0xD316,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD317,0xC6);
		
		EIE3810_TFTLCD_WrCmdData(0xD318,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD319,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD31A,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD31B,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD31C,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD31D,0x39);
		EIE3810_TFTLCD_WrCmdData(0xD31E,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD31F,0x79);
		EIE3810_TFTLCD_WrCmdData(0xD320,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD321,0xA1);
		EIE3810_TFTLCD_WrCmdData(0xD322,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD323,0xD9);
		EIE3810_TFTLCD_WrCmdData(0xD324,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD325,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD326,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD327,0x38);
		EIE3810_TFTLCD_WrCmdData(0xD328,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD329,0x67);
		EIE3810_TFTLCD_WrCmdData(0xD32A,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD32B,0x8F);		
		EIE3810_TFTLCD_WrCmdData(0xD32C,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD32D,0xCD);
		EIE3810_TFTLCD_WrCmdData(0xD32E,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD32F,0xFD);
		EIE3810_TFTLCD_WrCmdData(0xD330,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD331,0xFE);
		EIE3810_TFTLCD_WrCmdData(0xD332,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD333,0xFF);		
		EIE3810_TFTLCD_WrCmdData(0xD400,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD401,0x05);
		EIE3810_TFTLCD_WrCmdData(0xD402,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD403,0x40);		
		EIE3810_TFTLCD_WrCmdData(0xD404,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD405,0x6D);
		EIE3810_TFTLCD_WrCmdData(0xD406,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD407,0x90);
		EIE3810_TFTLCD_WrCmdData(0xD408,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD409,0x99);		
		EIE3810_TFTLCD_WrCmdData(0xD40A,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD40B,0xBB);
		EIE3810_TFTLCD_WrCmdData(0xD40C,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD40D,0xDC);
		
		EIE3810_TFTLCD_WrCmdData(0xD40E,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD40F,0x04);
		EIE3810_TFTLCD_WrCmdData(0xD410,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD411,0x25);
		EIE3810_TFTLCD_WrCmdData(0xD412,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD413,0x59);
		EIE3810_TFTLCD_WrCmdData(0xD414,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD415,0x82);
		EIE3810_TFTLCD_WrCmdData(0xD416,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD417,0xC6);
		
		EIE3810_TFTLCD_WrCmdData(0xD418,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD419,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD41A,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD41B,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD41C,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD41D,0x39);
		EIE3810_TFTLCD_WrCmdData(0xD41E,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD41F,0x79);
		EIE3810_TFTLCD_WrCmdData(0xD420,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD421,0xA1);
		EIE3810_TFTLCD_WrCmdData(0xD422,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD423,0xD9);
		EIE3810_TFTLCD_WrCmdData(0xD424,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD425,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD426,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD427,0x38);
		EIE3810_TFTLCD_WrCmdData(0xD428,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD429,0x67);
		EIE3810_TFTLCD_WrCmdData(0xD42A,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD42B,0x8F);
		EIE3810_TFTLCD_WrCmdData(0xD42C,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD42D,0xCD);		
		EIE3810_TFTLCD_WrCmdData(0xD42E,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD42F,0xFD);
		EIE3810_TFTLCD_WrCmdData(0xD430,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD431,0xFE);
		EIE3810_TFTLCD_WrCmdData(0xD432,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD433,0xFF);
		
		EIE3810_TFTLCD_WrCmdData(0xD500,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD501,0x05);
		EIE3810_TFTLCD_WrCmdData(0xD502,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD503,0x40);
		EIE3810_TFTLCD_WrCmdData(0xD504,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD505,0x6D);
		EIE3810_TFTLCD_WrCmdData(0xD506,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD507,0x90);
		EIE3810_TFTLCD_WrCmdData(0xD508,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD509,0x99);
		EIE3810_TFTLCD_WrCmdData(0xD50A,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD50B,0xBB);
		EIE3810_TFTLCD_WrCmdData(0xD50C,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD50D,0xDC);
		
		EIE3810_TFTLCD_WrCmdData(0xD50E,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD50F,0x04);
		EIE3810_TFTLCD_WrCmdData(0xD510,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD511,0x25);
		EIE3810_TFTLCD_WrCmdData(0xD512,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD513,0x59);
		EIE3810_TFTLCD_WrCmdData(0xD514,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD515,0x82);
		EIE3810_TFTLCD_WrCmdData(0xD516,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD517,0xC6);
		EIE3810_TFTLCD_WrCmdData(0xD518,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD519,0x01);
		
		EIE3810_TFTLCD_WrCmdData(0xD51A,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD51B,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD51C,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD51D,0x39);
		EIE3810_TFTLCD_WrCmdData(0xD51E,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD51F,0x79);
		EIE3810_TFTLCD_WrCmdData(0xD520,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD521,0xA1);
		EIE3810_TFTLCD_WrCmdData(0xD522,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD523,0xD9);
		EIE3810_TFTLCD_WrCmdData(0xD524,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD525,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD526,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD527,0x38);
		EIE3810_TFTLCD_WrCmdData(0xD528,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD529,0x67);		
		EIE3810_TFTLCD_WrCmdData(0xD52A,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD52B,0x8F);
		EIE3810_TFTLCD_WrCmdData(0xD52C,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD52D,0xCD);
		EIE3810_TFTLCD_WrCmdData(0xD52E,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD52F,0xFD);
		EIE3810_TFTLCD_WrCmdData(0xD530,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD531,0xFE);
		EIE3810_TFTLCD_WrCmdData(0xD532,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD533,0xFF);
		
		EIE3810_TFTLCD_WrCmdData(0xD600,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD601,0x05);
		EIE3810_TFTLCD_WrCmdData(0xD602,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD603,0x40);
		EIE3810_TFTLCD_WrCmdData(0xD604,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD605,0x6D);
		EIE3810_TFTLCD_WrCmdData(0xD606,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD607,0x90);
		EIE3810_TFTLCD_WrCmdData(0xD608,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD609,0x99);
		EIE3810_TFTLCD_WrCmdData(0xD60A,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD60B,0xBB);
		EIE3810_TFTLCD_WrCmdData(0xD60C,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD60D,0xDC);
		
		EIE3810_TFTLCD_WrCmdData(0xD60E,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD60F,0x04);
		EIE3810_TFTLCD_WrCmdData(0xD610,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD611,0x25);
		EIE3810_TFTLCD_WrCmdData(0xD612,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD613,0x59);
		EIE3810_TFTLCD_WrCmdData(0xD614,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD615,0x82);
		
		EIE3810_TFTLCD_WrCmdData(0xD616,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD617,0xC6);
		EIE3810_TFTLCD_WrCmdData(0xD618,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD619,0x01);
		EIE3810_TFTLCD_WrCmdData(0xD61A,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD61B,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD61C,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD61D,0x39);
		EIE3810_TFTLCD_WrCmdData(0xD61E,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD61F,0x79);
		EIE3810_TFTLCD_WrCmdData(0xD620,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD621,0xA1);
		
		EIE3810_TFTLCD_WrCmdData(0xD622,0x02);
		EIE3810_TFTLCD_WrCmdData(0xD623,0xD9);
		EIE3810_TFTLCD_WrCmdData(0xD624,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD625,0x00);
		EIE3810_TFTLCD_WrCmdData(0xD626,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD627,0x38);
		EIE3810_TFTLCD_WrCmdData(0xD628,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD629,0x67);		
		EIE3810_TFTLCD_WrCmdData(0xD62A,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD62B,0x8F);
		EIE3810_TFTLCD_WrCmdData(0xD62C,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD62D,0xCD);		
		EIE3810_TFTLCD_WrCmdData(0xD62E,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD62F,0xFD);
		EIE3810_TFTLCD_WrCmdData(0xD630,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD631,0xFE);
		EIE3810_TFTLCD_WrCmdData(0xD632,0x03);
		EIE3810_TFTLCD_WrCmdData(0xD633,0xFF);
		
		//LV2 Page 0 enable
		EIE3810_TFTLCD_WrCmdData(0xF000,0x55);
		EIE3810_TFTLCD_WrCmdData(0xF001,0xAA);
		EIE3810_TFTLCD_WrCmdData(0xF002,0x52);
		EIE3810_TFTLCD_WrCmdData(0xF003,0x08);
		EIE3810_TFTLCD_WrCmdData(0xF004,0x00);
		//Display control
		EIE3810_TFTLCD_WrCmdData(0xB100, 0xCC);
		EIE3810_TFTLCD_WrCmdData(0xB101, 0x00);
		//Source hold time
		EIE3810_TFTLCD_WrCmdData(0xB600,0x05);
		//Gate EQ control
		EIE3810_TFTLCD_WrCmdData(0xB700,0x70);
		EIE3810_TFTLCD_WrCmdData(0xB701,0x70);
		//Source EQ control (Mode 2)
		EIE3810_TFTLCD_WrCmdData(0xB800,0x01);
		EIE3810_TFTLCD_WrCmdData(0xB801,0x05);
		EIE3810_TFTLCD_WrCmdData(0xB802,0x05);
		EIE3810_TFTLCD_WrCmdData(0xB803,0x05);
		//Inversion mode (2-dot)
		EIE3810_TFTLCD_WrCmdData(0xBC00,0x00);
		EIE3810_TFTLCD_WrCmdData(0xBC01,0x00);
		EIE3810_TFTLCD_WrCmdData(0xBC02,0x00);
		//Timing control 4H w/ 4-delay
		EIE3810_TFTLCD_WrCmdData(0xC900,0xD0);
		EIE3810_TFTLCD_WrCmdData(0xC901,0x82);
		EIE3810_TFTLCD_WrCmdData(0xC902,0x50);
		EIE3810_TFTLCD_WrCmdData(0xC903,0x50);
		EIE3810_TFTLCD_WrCmdData(0xC904,0x50);
		
		EIE3810_TFTLCD_WrCmdData(0x3A00,0x55);  //16-bit/pixel
		EIE3810_TFTLCD_WrCmd(0x1100);
		Delay(120000);
		
		EIE3810_TFTLCD_WrCmd(0x2900);		
}




